#Использовать ".."

&Тест
Процедура УниФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниФункция());

КонецПроцедуры

&Тест
Процедура БиФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиФункция());

КонецПроцедуры

&Тест
Процедура ТерФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТерФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТерФункция());

КонецПроцедуры

&Тест
Процедура УниПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниПроцедура());

КонецПроцедуры

&Тест
Процедура БиПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиПроцедура());

КонецПроцедуры

&Тест
Процедура ТерПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТерПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТерПроцедура());

КонецПроцедуры
