#Использовать ".."

&Тест
Процедура Вызываемый() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.Вызываемый())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.Вызываемый());

КонецПроцедуры

&Тест
Процедура УниФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниФункция());

КонецПроцедуры

&Тест
Процедура БиФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиФункция());

КонецПроцедуры

&Тест
Процедура ТриФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТриФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТриФункция());

КонецПроцедуры

&Тест
Процедура Запускаемый() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.Запускаемый())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.Запускаемый());

КонецПроцедуры

&Тест
Процедура УниПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниПроцедура());

КонецПроцедуры

&Тест
Процедура БиПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиПроцедура());

КонецПроцедуры

&Тест
Процедура ТриПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТриПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТриПроцедура());

КонецПроцедуры
