#Использовать ".."

&Тест
Процедура Вызываемый() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.Вызываемый())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.Вызываемый());

КонецПроцедуры

&Тест
Процедура УниФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниФункция());

КонецПроцедуры

&Тест
Процедура БиФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиФункция());

КонецПроцедуры

&Тест
Процедура ТриФункция() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТриФункция())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТриФункция());

КонецПроцедуры

&Тест
Процедура Запускаемый() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.Запускаемый())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.Запускаемый());

КонецПроцедуры

&Тест
Процедура УниПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.УниПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.УниПроцедура());

КонецПроцедуры

&Тест
Процедура БиПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.БиПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.БиПроцедура());

КонецПроцедуры

&Тест
Процедура ТриПроцедура() Экспорт
	
	Ожидаем.Что(ФункциональныеИнтерфейсы.ТриПроцедура())
		.ИмеетТип("ИнтерфейсОбъекта")
		.Равно(ФункциональныеИнтерфейсы.ТриПроцедура());

КонецПроцедуры

&Тест
Процедура ФункциональныеИнтерфейсыПотокобезопасны() Экспорт

	// Дано
	Рефлектор = Новый Рефлектор();
	Рефлектор.УстановитьСвойство(ФункциональныеИнтерфейсы, "Вызываемый", Неопределено);

	// Когда

	Результаты = ВыполнитьВПятьсотПотоков(ЭтотОбъект, "ПроверитьИнтерфейс");

	// Тогда

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат)
			.ИмеетТип("Строка")
			.Равно("Вызвать");
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьИнтерфейс() Экспорт

	Возврат ФункциональныеИнтерфейсы.Вызываемый()
		.ПолучитьКартуИнтерфейса()
		[0]
		.Имя;

КонецФункции

Функция ВыполнитьВПятьсотПотоков(
	Сценарий,
	ИмяМетода,
	Параметр = Неопределено,
	ВторойПараметр = Неопределено,
	ТретийПараметр = Неопределено)
	
	Параметры = Новый Массив;

	Если Не Параметр = Неопределено Тогда
		Параметры.Добавить(Параметр);
	КонецЕсли;

	Если Не ВторойПараметр = Неопределено Тогда
		Параметры.Добавить(ВторойПараметр);
	КонецЕсли;

	Если Не ТретийПараметр = Неопределено Тогда
		Параметры.Добавить(ТретийПараметр);
	КонецЕсли;

	Задания = Новый Массив();

	Для Счетчик = 1 По 500 Цикл // BSLLS:UnusedLocalVariable-off

		Задания.Добавить(
			ФоновыеЗадания.Выполнить(Сценарий, ИмяМетода, Параметры)
		);

	КонецЦикла;

	ФоновыеЗадания.ОжидатьВсе(Задания);

	Для каждого ФоновоеЗадание Из Задания Цикл

		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ВызватьИсключение ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
		КонецЕсли;

	КонецЦикла;

	Результаты = Новый Массив;

	Для каждого ФоновоеЗадание Из Задания Цикл
		Результаты.Добавить(ФоновоеЗадание.Результат);
	КонецЦикла;

	Возврат Результаты;

КонецФункции
